# 'brew tap'
tap "hashicorp/tap"

# tmux
brew "tmux"
brew "tmuxinator-completion"

# neovim & dependencies
brew "ack"
brew "fd"
brew "fzf"
brew "neovim"
brew "ripgrep"
brew "universal-ctags"

# python & env
brew "autoenv"
brew "uv"
brew "pyenv"

# c/c++
brew "clang-format"
brew "cmake"
brew "gcc"
brew "llvm"

# ruby
brew "rbenv"
brew "ruby"
brew "rubyfmt"
brew "ruby-build"

# go
brew "go"
brew "goenv"
brew "golangci-lint"

# bash
brew "bash"
brew "bash-completion"

# rust
brew "rust"
brew "rust-analyzer"

# java
brew "jenv"
brew "openjdk"
brew "openjdk@11"

# node
brew "node"
brew "nodenv"
brew "node-build"

# general
brew "autobench"
brew "autojump"
brew "automake"
brew "bat"
brew "bazelisk"
brew "bottom"
brew "buildifier"
brew "ccat"
brew "cloc"
brew "cloudflared"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "derailed/k9s/k9s"
brew "diff-so-fancy"
brew "diffutils"
brew "fmt"
brew "fpp"
brew "gawk"
brew "git"
brew "gnupg"
brew "grpc"
brew "grpcurl"
brew "helm"
brew "htop"
brew "httperf"
brew "httpie"
brew "hugo"
brew "ijq"
brew "jq"
brew "lazygit"
brew "libb2"
brew "lua"
brew "luajit"
brew "luarocks"
brew "kubeconform"
brew "mpich"
brew "msgpack"
brew "msgpack-cxx"
brew "mtr"
brew "mycli"
brew "ncurses"
brew "openssl@3"
brew "pgcli"
brew "pinentry-mac"
brew "portaudio"
brew "postgresql"
brew "pre-commit"
brew "prettier"
brew "prettyping"
brew "pstree"
brew "readline"
brew "reattach-to-user-namespace"
brew "rsync"
brew "shellcheck"
brew "snappy"
brew "source-highlight"
brew "sqlite"
brew "terraform-ls"
bfre "tcl-tk@8"
brew "tig"
brew "tldr"
brew "trash"
brew "tree"
brew "tree-sitter"
brew "urlview"
brew "vim"
brew "watchman"
brew "wdiff"
brew "wget"
brew "xz"
brew "yq"
brew "zlib"

# lib*
brew "libevent"
brew "libfaketime"
brew "libmagic"
brew "libuv"
brew "libxml2"
brew "libxslt"
brew "libyaml"

# cask
cask "alacritty"
cask "diffmerge"
cask "bruno"
cask "mitmproxy"

# font
brew "font-meslo-lg-nerd-font"

# zsh
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-hightlighting"
brew "eza"
